export const HOME_PRESET_CONFIG: Record<number, string> = {
  0: 'hsla(11, 62%, 95%, .48)',
  1: 'rgba(215, 235, 255, .3)',
  2: 'rgba(205, 240, 235, .38)',
  3: 'hsla(30, 92%, 95%, .47)',
  4: 'rgba(222, 224, 255, .29)',
}

export const PPT_CONFIG = [
  {
    title: {
      pre: '智能PPT，',
      suf: '一键生成',
    },
    subTitle: '智能PPT，一键生成，轻松打造专业演示文稿。智能系统快速响应，高效生成精美内容，让您在会议、报告等场合脱颖而出。',
  },
  {
    title: {
      pre: '受众广泛，',
      suf: '灵活适用',
    },
    subTitle: '受众广泛，灵活适用，无论学生还是职场员工，都能轻松利用我们的平台。满足不同需求，让演示更专业，沟通更高效。',
  },
  {
    title: {
      pre: '丰富模板，',
      suf: '随选随用',
    },
    subTitle: '我们平台提供丰富多样的模板，满足您各种场景需求。同时，用户也可以上传模板共享，让选择更自由，创意无限。随选随用，轻松打造个性化演示。',
  },
  {
    title: {
      pre: '文档上传，',
      suf: '互鉴共享',
    },
    subTitle: '我们平台支持用户上传文档，实现资源共享。同时，用户还可以对模板进行评分，促进优秀作品的展示与交流，实现真正的互鉴共进。',
  },

]

export const UTILS_CONFIG = [
  {
    title: '文心一言',
    intro: '文心一言是百度推出的生成式对话产品，基于文心大模型技术，具备深度语义理解与生成能力，可以为用户提供智能对话体验。',
    url: 'gpt_1',
  },
  {
    title: '讯飞星火',
    intro: '讯飞星火是科大讯飞发布的大模型，具备文本生成、语言理解等7大核心能力，通过先进技术实现智能交互，为用户提供高效便捷的AI体验。',
    url: 'gpt_2',
  },
  {
    title: '通义千问',
    intro: '通义千问是阿里云推出的超大规模语言模型，具备多轮对话、文案创作等能力，为用户提供精准、高效的问题解答和创作支持。',
    url: 'gpt_4',
  },
]
